{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Тема 4: Сортировки, множества и словари\n",
    "# Тема 5: Текстовые файлы и таблицы"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 1\n",
    "\n",
    "В первой строке задаётся количество названий столиц - число N. В следующих N строках задаются названия столиц по одному в строке. Отсортируйте названия столиц в алфавитном порядке и выведите их по одному в строке.\n",
    "\n",
    "**Ввод**\n",
    "\n",
    "`3\n",
    "Moscow\n",
    "Washington\n",
    "Berlin`\n",
    "\n",
    "**Результат**\n",
    "\n",
    "`Berlin\n",
    "Moscow\n",
    "Washington`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 2\n",
    "\n",
    "Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором.\n",
    "\n",
    "**Ввод**\t\n",
    "\n",
    "`1 3 2`\n",
    "\n",
    "`4 3 2`\n",
    "\n",
    "**Результат**\n",
    "\n",
    "`2`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 3\n",
    "\n",
    "Каждый из N школьников некоторой школы знает Mi языков. Определите, какие языки знают все школьники и языки, которые знает хотя бы один из школьников.\n",
    "\n",
    "Первая строка входных данных содержит количество школьников N. Далее идет N чисел Mi, после каждого из чисел идет Mi строк, содержащих названия языков, которые знает i-й школьник. \n",
    "\n",
    "В первой строке выведите количество языков, которые знают все школьники. Начиная со второй строки - список таких языков, упорядоченный по алфавиту. Затем - количество языков, которые знает хотя бы один школьник, на следующих строках - список таких языков, упорядоченный по алфавиту.\n",
    "\n",
    "**Для примера:**\n",
    "\n",
    "**Ввод**\n",
    "\n",
    "`3\n",
    "3\n",
    "Russian\n",
    "English\n",
    "Japanese\n",
    "2\n",
    "Russian\n",
    "English\n",
    "1\n",
    "English`\n",
    "\n",
    "**Результат**\n",
    "\n",
    "`1\n",
    "English\n",
    "3\n",
    "English\n",
    "Japanese\n",
    "Russian`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 4\n",
    "\n",
    "Дан список стран и городов каждой страны. Затем даны названия городов. Для каждого города укажите, в какой стране он находится.\n",
    "\n",
    "Программа получает на вход количество стран N. Далее идет N строк, каждая строка начинается с названия страны, затем идут названия городов этой страны. В следующей строке записано число M, далее идут M запросов — названия каких-то M городов, перечисленных выше.\n",
    "\n",
    "Для каждого из запроса выведите название страны, в котором находится данный город.\n",
    "\n",
    "**Для примера:**\n",
    "\n",
    "**Ввод**\t\n",
    "`2\n",
    "Russia Moscow Petersburg Novgorod Kaluga\n",
    "Ukraine Kiev Odessa\n",
    "3\n",
    "Odessa\n",
    "Moscow\n",
    "Novgorod`\n",
    "\n",
    "**Результат**\n",
    "\n",
    "`Ukraine\n",
    "Russia\n",
    "Russia`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 5\n",
    "\n",
    "Ученые нашли табличку с текстом на языке иноплатенян. Определите, сколько уникальных слов содержится в этом тексте.\n",
    "\n",
    "Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки. Большие и маленькие буквы считаются различными.\n",
    "\n",
    "В этой и последующих задачах этого занятия вам нужно скачать файл по ссылке, запустить свой скрипт на собственном компьютере и ввести только ответ конкретно для этого файла.\n",
    "\n",
    "В этой задаче вам нужно подсчитать ответ для данного входного файла. Ссылка на файл -\n",
    "https://github.com/airilyann/Intro_to_DS_FreeUniversity/blob/master/aliens.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 6\n",
    "\n",
    "В csv-файле (разделитель - точка с запятой, кавычки не используются) содержится анонимизированная информация о зарплатах сотрудников в различных компаниях. В первом столбце записано название компании, а во втором - зарплата. Упорядочите компании по возрастанию средней зарплаты. В случае одинаковых средних зарплат в нескольких компаниях их следует упорядочить по алфавиту.\n",
    "Названия компаний следует выводить по одному в строке.\n",
    "\n",
    "Совет: используйте словарь, где ключом будет служить название компании, а в качестве значения будет храниться суммарная зарплата и количество сотрудников.\n",
    "\n",
    "csv-файл доступен по ссылке:\n",
    "https://github.com/airilyann/Intro_to_DS_FreeUniversity/blob/master/salary_data.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 7\n",
    "\n",
    "Для решения этой задачи необходимо установить библиотеку openpyxl, \n",
    "\n",
    "скачать файл https://github.com/airilyann/Intro_to_DS_FreeUniversity/blob/master/science_salary.xlsx\n",
    "\n",
    "и создать в папке с этим файлом скрипт со следующем содержанием:\n",
    "\n",
    "`import openpyxl\n",
    "wb = openpyxl.load_workbook('tab.xlsx')\n",
    "sh = wb.active\n",
    "nmin = sh.cell(row=7, column=2).value\n",
    "for rownum in range(8, 28):\n",
    "    nmin = min(nmin, sh.cell(row=rownum, column=2).value)\n",
    "print(nmin)`\n",
    "\n",
    "Запустите скрипт и в качестве ответа введите то, что он выведет.\n",
    "Напишите, почему"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
